app/views/users/_stats.html.erb

  <span class="user-post-count first">
    <%= pluralize(user.microposts.count, "post") %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1