app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "tttttt"], ["created_at", Thu, 31 Oct 2013 09:52:38 UTC +00:00], ["updated_at", Thu, 31 Oct 2013 09:52:38 UTC +00:00], ["user_id", 1]]
---
  def create
    @micropost = current_user.microposts.new(params[:micropost])
    if @micropost.save

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "7"]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 7]]
---
  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy