app/controllers/users_controller.rb

UPDATE "users" SET "name" = 'Jonh Smithasdfasfasdfasdf', "updated_at" = '2013-10-31 09:45:21.085761' WHERE "users"."id" = 1
---
  def update
    @user = current_user

    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def follower
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def following
    @user = User.find(params[:id])